package com.company;

public class Main {

    public static void main(String[] args) {
	/* написать метод, принимающий строку, содержащую слова разделенные пробелом и два функциональных интерфейса
	function and predicate. Метод должен предоставлять возможность реализации следующих действий:
	при длине слова 3 изменить все буквы этого слова на строчные и вернуть измененную строку
	при длине слова 3 изменить все буквы этого слова на заглавные и вернуть измененную строку
	при длине слова 4 изменить все буквы этого слова на строчные и вернуть измененную строку
	при длине слова 4 изменить все буквы этого слова на заглавные и вернуть измененную строку
	при длине слова 5 изменить все буквы этого слова на звездочки и вернуть измененную строку
	(т.е.написать лямбду для каждого случая ) */
    }
    
}
