package com.company;

public class Main {

    public static void main(String[] args) {
        // 1. Используя абстрактные классы написать программу выводящую на экран упорядоченный по возрастанию площади массив
        // из геометрических фигур (круг,квадарт,прямоугольеик). Протестировать правильность сортировки

        // 2. Используя интерфейсы написать метод, позволяющий вычислить общую площадь нескольких фигур
        // (круг,квадарт,прямоугольник) т.е. если площадь круга =50, прямоугольеика 100 , то в сумме 150 ). Протестировать
    }
}
